# Loading Issuance By Nationality
Loops through all of the excel files by nationality and puts them into a dataframe

In [31]:
import os
import pandas as pd

currentDirectory = os.getcwd()
initialNationalityDataframe = []

for filename in os.listdir(currentDirectory + "/NIV Issuance FY2023 Q4/By Nationality/"):
    filePath = os.path.join(currentDirectory + "/NIV Issuance FY2023 Q4/By Nationality/", filename)
    print(filename)
    month = filename.split()[0]
    year = filename.split()[1]
    df = pd.read_excel(filePath, skiprows=1)
    df['Month'] = month
    df['Year'] = year
    initialNationalityDataframe.append(df)

nationalityDataFrame = pd.concat(initialNationalityDataframe, ignore_index=True)
nationalityDataFrame

AUGUST 2023 - NIV Issuances by Nationality and Visa Class.xlsx
JULY 2023 - NIV Issuances by Nationality and Visa Class.xlsx
JUNE 2023 - NIV Issuances by Nationality and Visa Class.xlsx
SEPTEMBER 2023 - NIV Issuances by Nationality and Visa Class.xlsx

,Nationality,Visa Class,Issuances,Month,Year
0,Afghanistan,B1,1.0,AUGUST,2023
1,Afghanistan,B1/B2,153.0,AUGUST,2023
2,Afghanistan,F1,87.0,AUGUST,2023
3,Afghanistan,F2,3.0,AUGUST,2023
4,Afghanistan,G4,16.0,AUGUST,2023
...,...,...,...,...,...
15394,Zimbabwe,P1,2.0,SEPTEMBER,2023
15395,Zimbabwe,Q1,4.0,SEPTEMBER,2023
15396,Zimbabwe,R1,3.0,SEPTEMBER,2023
15397,GRAND TOTAL,NaN,849400.0,SEPTEMBER,2023
15398,"*""Non-nationality based issuances"" includes in...",NaN,NaN,SEPTEMBER,2023

# Loading Issuance By Post
Loops through all of the excel files by post and puts them into a dataframe

In [32]:
import os
import pandas as pd

currentDirectory = os.getcwd()
initialPostDataframe = []

for filename in os.listdir(currentDirectory + "/NIV Issuance FY2023 Q4/By Post/"):
    filePath = os.path.join(currentDirectory + "/NIV Issuance FY2023 Q4/By Post/", filename)
    print(filename)
    month = filename.split()[0]
    year = filename.split()[1]
    df = pd.read_excel(filePath, skiprows=1)
    df['Month'] = month
    df['Year'] = year
    initialPostDataframe.append(df)

postDataFrame = pd.concat(initialPostDataframe, ignore_index=True)
postDataFrame

AUGUST 2023 - NIV Issuances by Post and Visa Class.xlsx
JULY 2023 - NIV Issuances by Post and Visa Class.xlsx
JUNE 2023 - NIV Issuances by Post and Visa Class.xlsx
SEPTEMBER 2023 - NIV Issuances by Post and Visa Class.xlsx

              Post Visa Class  Issuances      Month  Year
0          Abidjan         A1          3     AUGUST  2023
1          Abidjan         A2          7     AUGUST  2023
2          Abidjan      B1/B2        513     AUGUST  2023
3          Abidjan         C1          5     AUGUST  2023
4          Abidjan       C1/D          3     AUGUST  2023
...            ...        ...        ...        ...   ...
18078       Zagreb         O3          1  SEPTEMBER  2023
18079       Zagreb         P3          1  SEPTEMBER  2023
18080       Zagreb         R1          2  SEPTEMBER  2023
18081       Zagreb         R2          2  SEPTEMBER  2023
18082  GRAND TOTAL        NaN     849400  SEPTEMBER  2023

[18083 rows x 5 columns]

# Filter Dataframes to only look at Visa Class H1B

In [34]:
h1bPostDataFrame = postDataFrame[postDataFrame['Visa Class'] == 'H1B']
h1bPostDataFrame

              Post Visa Class  Issuances      Month  Year
12         Abidjan        H1B          7     AUGUST  2023
31       Abu Dhabi        H1B         25     AUGUST  2023
55           Abuja        H1B          4     AUGUST  2023
72           Accra        H1B         42     AUGUST  2023
101    Addis Ababa        H1B          1     AUGUST  2023
...            ...        ...        ...        ...   ...
17968       Warsaw        H1B         19  SEPTEMBER  2023
18006        Wuhan        H1B         37  SEPTEMBER  2023
18021      Yaounde        H1B          3  SEPTEMBER  2023
18040      Yerevan        H1B          5  SEPTEMBER  2023
18067       Zagreb        H1B          7  SEPTEMBER  2023

[709 rows x 5 columns]

In [35]:
h1bNationalityDataFrame= nationalityDataFrame[nationalityDataFrame['Visa Class'] == 'H1B']
h1bNationalityDataFrame

               Nationality Visa Class  Issuances      Month  Year
5              Afghanistan        H1B        3.0     AUGUST  2023
20                 Albania        H1B       11.0     AUGUST  2023
44                 Algeria        H1B        2.0     AUGUST  2023
65                  Angola        H1B        1.0     AUGUST  2023
77     Antigua and Barbuda        H1B        1.0     AUGUST  2023
...                    ...        ...        ...        ...   ...
15270           Uzbekistan        H1B        2.0  SEPTEMBER  2023
15299            Venezuela        H1B       19.0  SEPTEMBER  2023
15332              Vietnam        H1B       34.0  SEPTEMBER  2023
15368               Zambia        H1B        2.0  SEPTEMBER  2023
15386             Zimbabwe        H1B        6.0  SEPTEMBER  2023

[567 rows x 5 columns]

# Issuances by Nationality
Number of issuances for each Nationality for the whole quarter of the fiscal year

In [38]:
issuanceByNationality = h1bNationalityDataFrame.groupby('Nationality')['Issuances'].sum().reset_index()

issuanceByNationality

                          Nationality  Issuances
0    *Non-Nationality Based Issuances        6.0
1                         Afghanistan        9.0
2                             Albania       21.0
3                             Algeria        5.0
4                              Angola        6.0
..                                ...        ...
162                         Venezuela       65.0
163                           Vietnam      187.0
164                             Yemen        5.0
165                            Zambia        8.0
166                          Zimbabwe       37.0

[167 rows x 2 columns]

# Issuances by Post
Number of issuances for each Post for the whole quarter of the fiscal year

In [39]:
issuanceByPost = h1bPostDataFrame.groupby('Post')['Issuances'].sum().reset_index()

issuanceByPost

           Post  Issuances
0    AIT Taipei        381
1       Abidjan         20
2     Abu Dhabi        109
3         Abuja         23
4         Accra        112
..          ...        ...
193    Windhoek          3
194       Wuhan        200
195     Yaounde         15
196     Yerevan         35
197      Zagreb         33

[198 rows x 2 columns]

# Issuance by Month (Post)
This gets the total issuance count for each month based on the post

In [40]:
issuanceByMonthPost = h1bPostDataFrame.groupby('Month')['Issuances'].sum().reset_index()

issuanceByMonthPost

       Month  Issuances
0     AUGUST      18348
1       JULY      16564
2       JUNE      20808
3  SEPTEMBER      14592

# Issuance by Month (Nationality)
This gets the total issuance count for each month based on the post

In [41]:
issuanceByMonthNationality = h1bNationalityDataFrame.groupby('Month')['Issuances'].sum().reset_index()

issuanceByMonthNationality

       Month  Issuances
0     AUGUST    18348.0
1       JULY    16564.0
2       JUNE    20808.0
3  SEPTEMBER    14592.0

# Average Issuance by Nationality
Looks at the average issuance by Nationality over Q4 of FY2023

In [42]:
averageByNationality = h1bNationalityDataFrame.groupby('Nationality')['Issuances'].mean().reset_index()

averageByNationality

                          Nationality  Issuances
0    *Non-Nationality Based Issuances   2.000000
1                         Afghanistan   3.000000
2                             Albania   5.250000
3                             Algeria   1.666667
4                              Angola   1.500000
..                                ...        ...
162                         Venezuela  16.250000
163                           Vietnam  46.750000
164                             Yemen   1.666667
165                            Zambia   2.000000
166                          Zimbabwe   9.250000

[167 rows x 2 columns]

# Average Issuance by Post
Looks at the average issuance by Post over Q4 of FY2023

In [44]:
averageByPost = h1bPostDataFrame.groupby('Post')['Issuances'].mean().reset_index()

averageByPost

           Post  Issuances
0    AIT Taipei      95.25
1       Abidjan       5.00
2     Abu Dhabi      27.25
3         Abuja       5.75
4         Accra      28.00
..          ...        ...
193    Windhoek       1.50
194       Wuhan      50.00
195     Yaounde       3.75
196     Yerevan       8.75
197      Zagreb       8.25

[198 rows x 2 columns]